{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hey :-)",
        "Hello, thanks for visiting",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
      "responses": ["Happy to help!", "Any time!", "My pleasure"]
    },
    {
      "tag": "about",
      "patterns": [
        "What is the purpose of this website?",
        "What kinds of services are there?",
        "How can I contact customer support?"
      ],
      "responses": [
        "The purpose of this website is to provide forecasting service and quality-parameter predictions for the given set of data fetched from IoT device or input manually",
        "Our platform specializes in providing forecasts and quality parameter predictions derived from data obtained through IoT devices or user input."
      ]
    },
    {
      "tag": "payments",
      "patterns": [
        "Do you take credit cards?",
        "Do you accept Mastercard?",
        "Can I pay with Paypal?",
        "Are you cash only?"
      ],
      "responses": [
        "We accept VISA, Mastercard and Paypal",
        "We accept most major credit cards, and Paypal"
      ]
    },
    {
      "tag": "Service",
      "patterns": [
        "What kind of decision support system do you offer?",
        "How long does shipping take?",
        "How do you generate real-time forecasts for water quality?",
        "What parameters can I monitor on the dashboard?",
        "How will I be notified about extreme events?",
        "Can I customize the parameters I want to track?"
      ],
      "responses": [
        "We provide an AI-enabled decision support system focused on predictive and adaptive solutions. Would you like to know more about how it works?",
        "We use pre-trained models to produce real-time forecasts of flow and water quality at multiple locations in a river body. Interested in seeing a demo?",
        "Our dashboard includes options for monitoring pH, Hardness, Solids, Chloramines, Sulfate, Conductivity, Organic Carbon, Trihalomethanes, Turbidity, and more. Would you like to explore a specific parameter?",
        "We send alerts to decision-makers to provide timely notice of extreme events. Would you like to learn how to set up alerts?",
        "Yes, you can customize the dashboard to focus on the specific parameters that matter most to you. Do you have particular parameters in mind?"
        

      ]
    },
    {
      "tag": "funny",
      "patterns": [
        "Tell me a joke!",
        "Tell me something funny!",
        "Do you know a joke?"
      ],
      "responses": [
        "Why did the hipster burn his mouth? He drank the coffee before it was cool.",
        "What did the buffalo say when his son left for college? Bison."
      ]
    }
  ]
}